# Пролог 3: Коридор
# Основан на файле "Диалоги/Пролог 3 Коридор.md"

label prologue_3_scene_1:
    scene bg corridor
    with dissolve

    "Локация: Коридор"

    show shinna at left
    s "Тихо, кажется кто-то идет"

    show alice closed frown blush at right
    a "(Испуганно) ..."

    n "Шинна гасит фонарик..."

    show helena smile
    h "Можешь все же зайдем в кабинет ненадолго?"
    h "Завтра нужно опубликовать новый выпуск"
    h "А материала кот наплакал"

    n "Сильвия медленно покачала головой"
    n "Девушки заходят за угол"
    n "Шинна резко включает фонарик и светит в глаза"

    h "Ауч!"

    show shinna frown
    s "Не слишком ли поздно для школьных прогулок?"

    show sylvia smile blush
    sy "Ох, президент"
    sy "Прошу прошения"
    sy "На носу соревнования"
    sy "Я тренируюсь сверхурочно"

    l "Сильвия, ты большая молодец"
    l "Не сомневаюсь, что ты отлично выступишь!"

    show sylvia closed smile blush
    sy "(смущенно) Спасибо, Леон..."

    s "Ну а ты Хелена?"
    s "У тебя тоже неожиданно проснулась любовь к дзюдо?"

    h "Ну, скажем так.."
    h "Некоторый спортивный интерес присутствует"
    h "Правда не к дзюдо..."

    s "Так или иначе ночные прогулки по школе запрещены"
    s "Если, конечно, это не согласовано с советом или с кем-то из учителей"

    sy "Я все поняла"
    sy "Такое больше не повторится."

    h "..."

    s "Хелена...?"

    h "Не повторится"

    show shinna smile
    s "Сильвия"
    s "Можешь считать, что твои вечерние тренировки согласованы"
    s "Только убедись, пожалуйста, что они не пересекаются с другими кружками"

    sy "Спасибо большое, президент"

    show mari smile
    m "О, Шинна-тян, очень добра и рассудительна..."

    h "Раз уж на то пошло"
    h "Можно ли пару раз в неделю тоже посещать спортивный зал и, скажем.."
    h "Кабинет биологии..."
    h "Исключительно в образовательных целях"

    show shinna frown
    s "(злостно) ..."
    s "Да, Хелена, тебе тоже можно"
    s "Но только без проникновения в закрытые кабинеты!"

    show helena opensmile
    h "Класс, президент, вы восхитительны!"
    h "Я помещу вас на обложку следующего выпуска школьной газеты!"
    h "Вне всяких сомнений!"
    h "В полный рост"
    h "Нужно что-то изящное.."
    h "Кстати.."
    h "У вас есть фотография в купальнике?"

    show shinna open
    s "(озадаченно) А теперь прошу извинить, мы опаздываем"
    s "Нужно еще подготовить актовый зал..."

    l "Ах, да."
    l "Хелена, Сильви, приятно было повидаться!"

    show sylvia closed smile blush
    sy "(смущенно) Ммм.."
    sy "Может вам нужна помощь?"
    sy "Вы ведь готовитесь к балу-маскараду?.."
    sy "Я на сегодня освободилась, мне как раз нечем заняться..."

    s "Неудобно просить"
    s "Но если честно, очень выручишь"

    show mari smile
    m "Ура, Сильви-тян с нами!"
    m "Будет весело!"

    l "Я очень рад, Сильвия"
    l "Правда мы взяли ужин только на четверых"
    l "Но я могу поделиться своим"

    show alice shout
    a "(возмущенно) Х..."

    show sylvia smile
    sy "(радостно) ..."

    h "(Так-с)"
    h "(Вечер подходит к концу, а материала для выпуска все еще нет...)"
    h "Шинна, вы не откажетесь и от моей помощи?"
    h "Если что ужин у меня с собой, можете не беспокоиться"

    show shinna smile
    s "Хелена, анализируя твою задумчивость, можно предположить, что у тебя есть какой-то личный интерес"
    s "Но нам действительно не помешает твоя помощь"
    s "Так что конечно я не вижу никаких причин отказывать тебе"

    sy "(О, президент видит людей на сквозь)"
    sy "(Надеюсь она не поняла в чем мой... личный интерес)"

    n "Группа отправляется по темному коридору к актовому залу"
    n "Алиса прижимается к Леону"

    l "Алиса? Все хорошо?"

    show alice closed frown blush
    a "Да..."
    a "Электродинамика!.."
    a "На чем мы остановились?"

    return
